examples/cavity3d/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel Newtonian;

rho             	rho [1 -3 0 0 0 0 0] 999.79684;

// liquid density polynomial (rho_L=rho_La+rho_Lb*(T-TRef_rho_L)+rho_Lc*(T-TRef_rho_L)^2)
TRef_rho_L			TRef_rho_L [0 0 0 1 0 0 0] 273.15;
rho_La				rho_La [1 -3 0 0 0 0 0] 999.79684;
rho_Lb				rho_Lb [1 -3 0 -1 0 0 0] 0.068317355;
rho_Lc				rho_Lc [1 -3 0 -2 0 0 0] -0.010740248;
rho_Ld				rho_Ld [1 -3 0 -2.5 0 0 0] 0.00082140905;
rho_Le				rho_Le [1 -3 0 -3 0 0 0] -2.3030988e-5;

// liquid specific heat quadratic polynomial (cp_L=cp_La+cp_Lb*(T-TRef_cp_L)+cp_Lc*(T-TRef_cp_L)^2)
TRef_cp_L			TRef_cp_L [0 0 0 1 0 0 0] 273.15;
cp_La             	cp_La [0 2 -2 -1 0 0 0] 4.213021e+03;
cp_Lb             	cp_Lb [0 2 -2 -2 0 0 0] -1.488785e+00;
cp_Lc             	cp_Lc [0 2 -2 -3 0 0 0] 1.559599e-02;

// liquid thermal conductivity quadratic polynomial (k_L=k_La+k_Lb*(T-TRef_k_L)+k_Lc*(T-TRef_k_L)^2)
TRef_k_L			TRef_k_L [0 0 0 1 0 0 0] 273.15;
k_La         	 	k_La [1 1 -3 -1 0 0 0] 5.602895e-01;
k_Lb         	 	k_Lb [1 1 -3 -2 0 0 0] 2.130754e-03;
k_Lc         	 	k_Lc [1 1 -3 -3 0 0 0] -9.462417e-06;

// kinematic viscosity (nu=1/(nua+nub*T+nuc*T^2))
TRef_nu				TRef_nu [0 0 0 1 0 0 0] 0.0;
nu              	nu [0 2 -1 0 0 0 0] 1.787e-06; // required, but will be overwritten during runtime
nua					nua [0 -2 1 0 0 0 0] -2.327547e+05;
nub					nub [0 -2 1 -1 0 0 0] -1.608951e+04;
nuc					nuc [0 -2 1 -2 0 0 0] 6.931645e+01;

// solid density polynomial (rho_S=rho_Sa+rho_Sb*T+rho_Sc*T^2)
TRef_rho_S			TRef_rho_S [0 0 0 1 0 0 0] 273.15;
rho_Sa				rho_Sa [1 -3 0 0 0 0 0] 9.169417e+2;
rho_Sb				rho_Sb [1 -3 0 -1 0 0 0] -1.652339e-1;
rho_Sc				rho_Sc [1 -3 0 -2 0 0 0] -4.320109e-4;

// solid specific heat quadratic polynomial (cp_S=cp_Sa+cp_Sb*(T-TRef_cp_S)+cp_Sc*(T-TRef_cp_S)^2)
TRef_cp_S			TRef_cp_S [0 0 0 1 0 0 0] 273.15;
cp_Sa             	cp_Sa [0 2 -2 -1 0 0 0] 2.111883e+03;
cp_Sb             	cp_Sb [0 2 -2 -2 0 0 0] 7.963648e+00;
cp_Sc             	cp_Sc [0 2 -2 -3 0 0 0] 4.269703e-03;

// solid thermal conductivity quadratic polynomial (k_S=k_Sa+k_Sb*(T-TRef_k_S)+k_Sc*(T-TRef_k_S)^2)
TRef_k_S			TRef_k_S [0 0 0 1 0 0 0] 273.15;
k_Sa             	k_Sa [1 1 -3 -1 0 0 0] 2.160110e+00;
k_Sb             	k_Sb [1 1 -3 -2 0 0 0] -1.013515e-02;
k_Sc             	k_Sc [1 1 -3 -3 0 0 0] 5.279606e-05;

beta            	beta [0 0 0 -1 0 0 0] 1.0;

TRef            	TRef [0 0 0 1 0 0 0] 273.1;
T_S             	T_S [0 0 0 1 0 0 0] 273.1;
T_L             	T_L [0 0 0 1 0 0 0] 273.15;
h_m             	h_m [0 2 -2 0 0 0 0] 333700;
DarcyConstant   	DarcyConstant [1 -3 -1 0 0 0 0] 1.0e8;
DarcyTerm_epsilon	DarcyTerm_epsilon [0 0 0 0 0 0 0] 1e-06;

// ************************************************************************* //
